// import {get, post} from './http'

import {post} from './http'

// 判断管理员是否登录成功
export const checkAdmin = (url, params) => {
  return post(url, params)
}

// ============歌手相关================
// 查询歌手
// 添加歌手
// 编辑歌手
// 删除歌手

// ============歌曲相关================
// 根据歌手id查询歌曲
// 编辑歌曲
// 删除歌曲
// 根据歌曲id查询歌曲对象
// 根据歌曲名获取歌曲对象
// 查询所有歌曲

// ============歌单相关================
// 查询歌单

// 添加歌单
// 编辑歌单
// 删除歌单

// ============歌单的歌曲相关============
// 根据歌单id查询歌曲列表
// 给歌单增加歌曲
// 删除歌单的歌曲

// ============用户相关================
// 查询用户

// 添加用户

// 编辑用户

// 删除用户

// 根据用户id查询该用户的详细信息

// ===============收藏===================
// 指定用户的收藏列表
// 删除用户收藏的歌曲

// ===============评论===================
// 指定歌单的评论列表

// 删除评论
